import numpy as np


# 그 외 stack()
# h, v
# 열, 행 방향으로 병합(가로, 세로)

a = np.array([[[1,1],[1,1]],[[1,1],[1,1]]])
b = np.array([[[2,2],[2,2]],[[2,2],[2,2]]])
print(a.shape) # (2, 2, 2)

c = np.hstack((a,b)) # 열방향으로 병합 (차원이 추가 되지 않음)
# print(c) # [[[1 1], [1 1], [2 2], [2 2]], [[1 1], [1 1], [2 2], [2 2]]]
print(c.shape) # (2, 4, 2)

c2 = np.stack((a,b), axis =1)
# print(c2) # [[[[1 1], [1 1]], [[2 2], [2 2]]], [[[1 1], [1 1]], [[2 2], [2 2]]]]
print(c2.shape) # (2, 2, 2, 2)

d = np.vstack((a,b)) 
# print(d) # [[[1 1], [1 1]], [[1 1], [1 1]], [[2 2], [2 2]], [[2 2], [2 2]]]
print(d.shape) # (4, 2, 2)


# d
# 깊이 방향으로 병합 (축)
e = np.dstack((a,b)) # [[[1 1 2 2], [1 1 2 2]], [[1 1 2 2], [1 1 2 2]]]
# print(e)
print(e.shape) # (2, 2, 4)